Ran Plan for dir: `.` workspace: `stage`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_kubernetes_cluster.cluster-kube will be created
+ resource "yandex_kubernetes_cluster" "cluster-kube" {
      + cluster_ipv4_range       = "10.10.0.0/16"
      + cluster_ipv6_range       = (known after apply)
      + created_at               = (known after apply)
      + description              = "description"
      + folder_id                = (known after apply)
      + health                   = (known after apply)
      + id                       = (known after apply)
      + labels                   = (known after apply)
      + log_group_id             = (known after apply)
      + name                     = "cluster-kube-15-4"
      + network_id               = "enp3267cf1kffb3rsa8b"
      + network_policy_provider  = "CALICO"
      + node_ipv4_cidr_mask_size = 24
      + node_service_account_id  = "ajeq6hjsdv086q8dsq9c"
      + release_channel          = "STABLE"
      + service_account_id       = "ajeq6hjsdv086q8dsq9c"
      + service_ipv4_range       = "10.20.0.0/16"
      + service_ipv6_range       = (known after apply)
      + status                   = (known after apply)

      + master {
          + cluster_ca_certificate = (known after apply)
          + external_v4_address    = (known after apply)
          + external_v4_endpoint   = (known after apply)
          + internal_v4_address    = (known after apply)
          + internal_v4_endpoint   = (known after apply)
          + public_ip              = true
          + version                = "1.20"
          + version_info           = (known after apply)

          + maintenance_policy {
              + auto_upgrade = true

              + maintenance_window {
                  + day        = "friday"
                  + duration   = "4h30m"
                  + start_time = "10:00"
                }
              + maintenance_window {
                  + day        = "monday"
                  + duration   = "3h"
                  + start_time = "15:00"
                }
            }

          + regional {
              + region = "ru-central1"

              + location {
                  + subnet_id = "e9bblabblipe7e8k1998"
                  + zone      = "ru-central1-a"
                }
              + location {
                  + subnet_id = "e2ltgfbsghk0341b5stj"
                  + zone      = "ru-central1-b"
                }
              + location {
                  + subnet_id = "b0ccs903icofsoh618t7"
                  + zone      = "ru-central1-c"
                }
            }

          + zonal {
              + subnet_id = (known after apply)
              + zone      = (known after apply)
            }
        }
    }

  # yandex_kubernetes_node_group.node-group-15-4-a will be created
+ resource "yandex_kubernetes_node_group" "node-group-15-4-a" {
      + cluster_id        = (known after apply)
      + created_at        = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "node-group-15-4-a"
      + status            = (known after apply)
      + version           = "1.20"
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-a"
            }
        }

      + deploy_policy {
          + max_expansion   = (known after apply)
          + max_unavailable = (known after apply)
        }

      + instance_template {
          + metadata                  = {
              + "ssh-keys" = <<-EOT
                    maxn:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDwD/ZD2D9tLVS+DdTABaYy/nh8LwkoTmQc7OBbuZOSyv2xJ55ND8C1GUAQ4HOy0s/774Uda5CkEHrk82nOJW0r0uRP4s6EMPNMp2m5ZMxwn1OkbzI6KmbWI0bcCe/g9IsAx0AUH5gX5cxz44Ysk1TfH1zgacOiiXwc0I9LralwIsRC702AXpbSEzflkTm9FxgmUWssVlHPSMRyzOosIj/ax5Egrx1/wmzxyn1RuX/j0XNEUJbfRL4KXwbHFePrzborMhF0MusX3JI4eax1db0skoGzWXHhbfgTmXqCY/Ph4fI9W7ZpauIu6TF4F9dbMTyzIyfzpux0RACJiPl30j0/+klRipVy7BAY/R7ZyFgRO82h0fAL6+9it+NxRD59YfMdvU/U4zOAs/3CgawzZEUu9c16LhqvspbXkvONx7WBwQQtRmYLsOHiqJc+Zt+xb56JMNbTpURziwFXd8AuVyVDBpHBCm9yIhTotZYIAd4HkzKzJ6IUOuPA0P7GG3FERSM= maxn@docker-nm
                EOT
            }
          + nat                       = (known after apply)
          + network_acceleration_type = (known after apply)
          + platform_id               = "standard-v1"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_runtime {
              + type = "containerd"
            }

          + network_interface {
              + ipv4       = true
              + ipv6       = (known after apply)
              + nat        = true
              + subnet_ids = [
                  + "e9bblabblipe7e8k1998",
                ]
            }

          + resources {
              + core_fraction = 20
              + cores         = 2
              + gpus          = 0
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = true
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true

          + maintenance_window {
              + day        = "friday"
              + duration   = "4h30m"
              + start_time = "10:00"
            }
          + maintenance_window {
              + day        = "monday"
              + duration   = "3h"
              + start_time = "15:00"
            }
        }

      + scale_policy {
          + auto_scale {
              + initial = 1
              + max     = 1
              + min     = 1
            }
        }
    }

  # yandex_kubernetes_node_group.node-group-15-4-b will be created
+ resource "yandex_kubernetes_node_group" "node-group-15-4-b" {
      + cluster_id        = (known after apply)
      + created_at        = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "node-group-15-4-b"
      + status            = (known after apply)
      + version           = "1.20"
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-b"
            }
        }

      + deploy_policy {
          + max_expansion   = (known after apply)
          + max_unavailable = (known after apply)
        }

      + instance_template {
          + metadata                  = {
              + "ssh-keys" = <<-EOT
                    maxn:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDwD/ZD2D9tLVS+DdTABaYy/nh8LwkoTmQc7OBbuZOSyv2xJ55ND8C1GUAQ4HOy0s/774Uda5CkEHrk82nOJW0r0uRP4s6EMPNMp2m5ZMxwn1OkbzI6KmbWI0bcCe/g9IsAx0AUH5gX5cxz44Ysk1TfH1zgacOiiXwc0I9LralwIsRC702AXpbSEzflkTm9FxgmUWssVlHPSMRyzOosIj/ax5Egrx1/wmzxyn1RuX/j0XNEUJbfRL4KXwbHFePrzborMhF0MusX3JI4eax1db0skoGzWXHhbfgTmXqCY/Ph4fI9W7ZpauIu6TF4F9dbMTyzIyfzpux0RACJiPl30j0/+klRipVy7BAY/R7ZyFgRO82h0fAL6+9it+NxRD59YfMdvU/U4zOAs/3CgawzZEUu9c16LhqvspbXkvONx7WBwQQtRmYLsOHiqJc+Zt+xb56JMNbTpURziwFXd8AuVyVDBpHBCm9yIhTotZYIAd4HkzKzJ6IUOuPA0P7GG3FERSM= maxn@docker-nm
                EOT
            }
          + nat                       = (known after apply)
          + network_acceleration_type = (known after apply)
          + platform_id               = "standard-v1"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_runtime {
              + type = "containerd"
            }

          + network_interface {
              + ipv4       = true
              + ipv6       = (known after apply)
              + nat        = true
              + subnet_ids = [
                  + "e2ltgfbsghk0341b5stj",
                ]
            }

          + resources {
              + core_fraction = 20
              + cores         = 2
              + gpus          = 0
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = true
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true

          + maintenance_window {
              + day        = "friday"
              + duration   = "4h30m"
              + start_time = "10:00"
            }
          + maintenance_window {
              + day        = "monday"
              + duration   = "3h"
              + start_time = "15:00"
            }
        }

      + scale_policy {
          + auto_scale {
              + initial = 1
              + max     = 1
              + min     = 1
            }
        }
    }

  # yandex_kubernetes_node_group.node-group-15-4-c will be created
+ resource "yandex_kubernetes_node_group" "node-group-15-4-c" {
      + cluster_id        = (known after apply)
      + created_at        = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "node-group-15-4-c"
      + status            = (known after apply)
      + version           = "1.20"
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-c"
            }
        }

      + deploy_policy {
          + max_expansion   = (known after apply)
          + max_unavailable = (known after apply)
        }

      + instance_template {
          + metadata                  = {
              + "ssh-keys" = <<-EOT
                    maxn:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDwD/ZD2D9tLVS+DdTABaYy/nh8LwkoTmQc7OBbuZOSyv2xJ55ND8C1GUAQ4HOy0s/774Uda5CkEHrk82nOJW0r0uRP4s6EMPNMp2m5ZMxwn1OkbzI6KmbWI0bcCe/g9IsAx0AUH5gX5cxz44Ysk1TfH1zgacOiiXwc0I9LralwIsRC702AXpbSEzflkTm9FxgmUWssVlHPSMRyzOosIj/ax5Egrx1/wmzxyn1RuX/j0XNEUJbfRL4KXwbHFePrzborMhF0MusX3JI4eax1db0skoGzWXHhbfgTmXqCY/Ph4fI9W7ZpauIu6TF4F9dbMTyzIyfzpux0RACJiPl30j0/+klRipVy7BAY/R7ZyFgRO82h0fAL6+9it+NxRD59YfMdvU/U4zOAs/3CgawzZEUu9c16LhqvspbXkvONx7WBwQQtRmYLsOHiqJc+Zt+xb56JMNbTpURziwFXd8AuVyVDBpHBCm9yIhTotZYIAd4HkzKzJ6IUOuPA0P7GG3FERSM= maxn@docker-nm
                EOT
            }
          + nat                       = (known after apply)
          + network_acceleration_type = (known after apply)
          + platform_id               = "standard-v1"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_runtime {
              + type = "containerd"
            }

          + network_interface {
              + ipv4       = true
              + ipv6       = (known after apply)
              + nat        = true
              + subnet_ids = [
                  + "b0ccs903icofsoh618t7",
                ]
            }

          + resources {
              + core_fraction = 20
              + cores         = 2
              + gpus          = 0
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = true
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true

          + maintenance_window {
              + day        = "friday"
              + duration   = "4h30m"
              + start_time = "10:00"
            }
          + maintenance_window {
              + day        = "monday"
              + duration   = "3h"
              + start_time = "15:00"
            }
        }

      + scale_policy {
          + auto_scale {
              + initial = 1
              + max     = 1
              + min     = 1
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ kube-cluster-ca-cert      = (known after apply)
+ kube-cluster-ext-endpoint = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w stage`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-0:4141/lock?id=MaxNelipin%252Fdiplom-terraform%252F.%252Fstage)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w stage`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
